In [19]:
import pandas as pd

file = 'aarhus_parking.csv'

df = pd.read_csv(file)

df.head(10)

,vehiclecount,updatetime,_id,totalspaces,garagecode,streamtime
0,0,2014-05-22 09:09:04.145,1,65,NORREPORT,2014-11-03 16:18:44
1,0,2014-05-22 09:09:04.145,2,512,SKOLEBAKKEN,2014-11-03 16:18:44
2,869,2014-05-22 09:09:04.145,3,1240,SCANDCENTER,2014-11-03 16:18:44
3,22,2014-05-22 09:09:04.145,4,953,BRUUNS,2014-11-03 16:18:44
4,124,2014-05-22 09:09:04.145,5,130,BUSGADEHUSET,2014-11-03 16:18:44
5,106,2014-05-22 09:09:04.145,6,400,MAGASIN,2014-11-03 16:18:44
6,115,2014-05-22 09:09:04.145,7,210,KALKVAERKSVEJ,2014-11-03 16:18:44
7,233,2014-05-22 09:09:04.145,8,700,SALLING,2014-11-03 16:18:44
8,0,2014-05-22 09:39:01.803,9,65,NORREPORT,2014-11-03 16:18:44
9,0,2014-05-22 09:39:01.803,10,512,SKOLEBAKKEN,2014-11-03 16:18:44

In [23]:
df.describe()

       vehiclecount           _id   totalspaces
count  55264.000000  55264.000000  55264.000000
mean     192.188387  27667.796468    526.250000
std      210.500021  15959.295617    388.536895
min        0.000000      1.000000     65.000000
25%       32.000000  13855.750000    190.000000
50%       96.000000  27671.500000    456.000000
75%      296.000000  41487.250000    763.250000
max     1464.000000  55303.000000   1240.000000

In [24]:
df['garagecode'].describe()

count         55264
unique            8
top       NORREPORT
freq           6908
Name: garagecode, dtype: object